reinforcement/Lecture-2-Markov-Decision-Processes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-15 二 16:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jian Qin" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. MDP定义</a>
<ul>
<li><a href="#orgheadline1">1.1. 组成</a></li>
</ul>
</li>
<li><a href="#orgheadline6">2. Markov Reward Process</a>
<ul>
<li><a href="#orgheadline4">2.1. Return</a>
<ul>
<li><a href="#orgheadline3">2.1.1. 为什么使用discount?</a></li>
</ul>
</li>
<li><a href="#orgheadline5">2.2. Value Function</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> MDP定义</h2>
<div class="outline-text-2" id="text-1">
<p>
MDP定义了一个适合应用RL的环境. 环境完全可见, 与历史无关. 
</p>
<blockquote>
<p>
Almost all RL problems can be formalised as MDPs, 
</p>
</blockquote>
<p>
具体定义略过.
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 组成</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>所有的状态集(S)</li>
<li>状态转移矩阵(P)</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> Markov Reward Process</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
A Markov reward process is a Markov chain with values.
</p>
</blockquote>
<p>
具体定义:
</p>
<ol class="org-ol">
<li>S 同上</li>
<li>P 同上</li>
<li>R reward function  \(R_s = E[R_{t+1} |  S_t = s]\)</li>
<li>&gamma; discount factor, \(\gamma  \in [0,1]\)</li>
</ol>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> Return</h3>
<div class="outline-text-3" id="text-2-1">
<p>
\(G_t = \sum_{k = 0}^{\infty}\gamma^kR_{t+k+1}\)
其中的discount factor如果是0, 则侧重眼前, 1, 则更加注意整体利益.
</p>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">2.1.1</span> 为什么使用discount?</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li>数学上合适<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></li>
<li>避免无限循环</li>
<li>未来的不确定性没法完全的表示<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></li>
<li>财务上, 立即赚钱相对来说更加划算</li>
<li>动物和人类也表现的更加喜欢即时的奖励<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></li>
<li>某些情况下适合使用<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.2</span> Value Function</h3>
<div class="outline-text-3" id="text-2-2">
<p>
the expected return starting from state <i>s</i>:
</p>

<p>
\(v(s) = E[G_t | S_t = s]\)
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Why?
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
?
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
这不代表机器也要一样.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
具体的使用场景?
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Jian Qin</p>
<p class="date">Created: 2016-03-15 二 16:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
